In [2]:
import pandas as pd

In [3]:
df=pd.read_excel('data/CCIHE2021-PublicData.xlsx',sheet_name='Data') # Carnegie university clasification as dataframe

In [4]:
df.head()

,unitid,name,city,stabbr,basic2000,basic2005,basic2010,basic2015,basic2018,basic2021,...,satv25,satm25,satcmb25,actcmp25,satacteq25,actfinal,appsf20,admitsf20,pctadmitf20,selindex
0,100654,Alabama A & M University,Normal,AL,16,18,18,18,18,18,...,430.0,410.0,840.0,15.0,15.0,15.000000,9855.0,8835.0,0.896499,1.0
1,100663,University of Alabama at Birmingham,Birmingham,AL,15,15,15,15,15,15,...,560.0,530.0,1090.0,22.0,21.0,21.875310,10391.0,8375.0,0.805986,2.0
2,100690,Amridge University,Montgomery,AL,51,24,24,20,20,20,...,0.0,0.0,0.0,0.0,0.0,0.000000,0.0,0.0,0.000000,1.0
3,100706,University of Alabama in Huntsville,Huntsville,AL,16,16,15,16,16,15,...,590.0,580.0,1170.0,24.0,24.0,24.000000,5793.0,4467.0,0.771103,3.0
4,100724,Alabama State University,Montgomery,AL,21,18,18,19,19,17,...,438.0,406.0,840.0,14.0,15.0,14.298675,7027.0,6948.0,0.988758,1.0

In [5]:
df.columns  #Returns the names of all the columns.

Index(['unitid', 'name', 'city', 'stabbr', 'basic2000', 'basic2005',
       'basic2010', 'basic2015', 'basic2018', 'basic2021',
       ...
       'satv25', 'satm25', 'satcmb25', 'actcmp25', 'satacteq25', 'actfinal',
       'appsf20', 'admitsf20', 'pctadmitf20', 'selindex'],
      dtype='object', length=103)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3939 entries, 0 to 3938
Columns: 103 entries, unitid to selindex
dtypes: float64(32), int64(68), object(3)
memory usage: 3.1+ MB

In [7]:
df.stabbr.unique()  #list of all states and territories mentioned in the data.

array(['AL', 'AK', 'WA', 'AZ', 'NM', 'AR', 'CA', 'MN', 'CO', 'CT', 'DE',
       'DC', 'FL', 'GA', 'HI', 'ID', 'IL', 'IN', 'IA', 'KS', 'MO', 'KY',
       'LA', 'ME', 'MD', 'MA', 'MI', 'MS', 'MT', 'NE', 'NV', 'NH', 'NJ',
       'NY', 'NC', 'ND', 'OH', 'OK', 'OR', 'PA', 'RI', 'SC', 'SD', 'TN',
       'TX', 'UT', 'VT', 'VA', 'WV', 'WI', 'WY', 'AS', 'GU', 'MP', 'PR',
       'FM', 'PW', 'VI', 'MH'], dtype=object)

Besides the 50 US states and DC, this array includes other US territories as well. College board either does not include these territories in their data or combine them together to "US territories" column. So, probably we would want to ignore them. It seems they all appear after 'WY' in the above list of states and territories.

In [8]:
territories = ['AS','GU','MP','FM','PW','VI','MH','PR']  #US territories that appear in the data (excluding DC)

In [9]:
df[df['basic2021'].isin([15,16])].stabbr.unique()  #The states that contain R1/R2 universities in 2021.

array(['AL', 'AK', 'AZ', 'AR', 'CA', 'CO', 'CT', 'DE', 'DC', 'FL', 'GA',
       'HI', 'ID', 'IL', 'IN', 'IA', 'KS', 'KY', 'LA', 'ME', 'MD', 'MA',
       'MI', 'MN', 'MS', 'MO', 'MT', 'NE', 'NV', 'NH', 'NJ', 'NM', 'NY',
       'NC', 'ND', 'OH', 'OK', 'OR', 'PA', 'RI', 'SC', 'SD', 'TN', 'TX',
       'UT', 'VT', 'VA', 'WA', 'WV', 'WI', 'WY', 'PR'], dtype=object)

In [10]:
df = df.drop(df[df['stabbr'].isin(territories)].index)  #Drop all the states from the list "territories"

In [11]:
df.stabbr.unique()  #Now we can see there are exactly 51 unique entries in stabbr.

array(['AL', 'AK', 'WA', 'AZ', 'NM', 'AR', 'CA', 'MN', 'CO', 'CT', 'DE',
       'DC', 'FL', 'GA', 'HI', 'ID', 'IL', 'IN', 'IA', 'KS', 'MO', 'KY',
       'LA', 'ME', 'MD', 'MA', 'MI', 'MS', 'MT', 'NE', 'NV', 'NH', 'NJ',
       'NY', 'NC', 'ND', 'OH', 'OK', 'OR', 'PA', 'RI', 'SC', 'SD', 'TN',
       'TX', 'UT', 'VT', 'VA', 'WV', 'WI', 'WY'], dtype=object)

In [12]:
carnegie21=df[['name','city','stabbr','basic2021']]  #New dataframe with only basic classification in 2021

In [13]:
carnegie21.head(n=5)

                                  name        city stabbr  basic2021
0             Alabama A & M University      Normal     AL         18
1  University of Alabama at Birmingham  Birmingham     AL         15
2                   Amridge University  Montgomery     AL         20
3  University of Alabama in Huntsville  Huntsville     AL         15
4             Alabama State University  Montgomery     AL         17

In [14]:
carnegieR1R2=carnegie21.loc[carnegie21['basic2021'].isin([15,16])]  #New dataframe with only R1/R2 universities under basic2021 classification

In [15]:
len(carnegieR1R2.index)  #Altogether, there are 278 R1/R2 universities.

278

In [16]:
R1R2count = {'stabbr':[],'R1count':[],'R2count':[]}
for i in carnegieR1R2.stabbr.unique():
    R1R2count['stabbr'].append(i)
    R1R2count['R1count'].append(len(carnegieR1R2.loc[carnegieR1R2.stabbr.eq(i) & carnegieR1R2.basic2021.eq(15)]))
    R1R2count['R2count'].append(len(carnegieR1R2.loc[carnegieR1R2.stabbr.eq(i) & carnegieR1R2.basic2021.eq(16)]))

R1R2count=pd.DataFrame(R1R2count)
R1R2count['R1plusR2']=R1R2count.R1count+R1R2count.R2count

#Here we created a new dataframe counting R1/R2 universities in each of the 51 states and territories

In [17]:
print(R1R2count)

   stabbr  R1count  R2count  R1plusR2
0      AL        4        1         5
1      AK        0        1         1
2      AZ        2        2         4
3      AR        1        2         3
4      CA       11       14        25
5      CO        5        1         6
6      CT        2        0         2
7      DE        1        0         1
8      DC        2        3         5
9      FL        6        5        11
10     GA        4        5         9
11     HI        1        0         1
12     ID        0        3         3
13     IL        4        6        10
14     IN        3        2         5
15     IA        2        0         2
16     KS        2        1         3
17     KY        2        0         2
18     LA        3        3         6
19     ME        1        1         2
20     MD        3        2         5
21     MA        8        5        13
22     MI        3        5         8
23     MN        1        0         1
24     MS        3        1         4
25     MO        2        4         6
26     MT        2        0         2
27     NE        1        2         3
28     NV        2        0         2
29     NH        2        0         2
30     NJ        3        6         9
31     NM        1        1         2
32     NY       11        8        19
33     NC        3        6         9
34     ND        1        1         2
35     OH        5        8        13
36     OK        2        1         3
37     OR        2        1         3
38     PA        6        6        12
39     RI        1        1         2
40     SC        2        0         2
41     SD        0        2         2
42     TN        3        4         7
43     TX       11       11        22
44     UT        2        1         3
45     VT        0        1         1
46     VA        5        2         7
47     WA        2        0         2
48     WV        1        1         2
49     WI        2        1         3
50     WY        0        1         1

In [19]:
ap_performance = pd.read_excel('data/ap-performance-2012-2022.xlsx')  #Reading the ap-performance excel file

In [21]:
ap_performance.head()  #Unfortunately, the data is not organized an conveniently as the Carnegie classification data

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,NaN,AP Performance,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,Total AP Exams,NaN,NaN,NaN
4,NaN,NaN,NaN,2022,2021,2017,2012